; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	infrared2 - mode
	spectrograph0 - mode
	infrared1 - mode
	spectrograph3 - mode
	thermograph4 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation0 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph3)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument7 infrared2)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
)
(:goal (and
	(pointing satellite2 GroundStation2)
	(have_image Star5 thermograph4)
	(have_image Star6 infrared2)
	(have_image Star7 infrared1)
	(have_image Planet8 spectrograph0)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 spectrograph3)
	(have_image Phenomenon11 spectrograph3)
	(have_image Star12 spectrograph0)
	(have_image Planet13 thermograph4)
))

)

; plan
1. (turn_to satellite2 groundstation2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 10
3. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 1 of 10
4. (turn_to satellite2 star12 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star12)
   goals met: 0 of 10
5. (take_image satellite2 star12 instrument5 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 1 of 10
6. (turn_to satellite2 planet8 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 planet8)
   goals met: 1 of 10
7. (take_image satellite2 planet8 instrument5 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 2 of 10
8. (turn_to satellite2 phenomenon9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 10
9. (turn_to satellite1 groundstation2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation2)
   goals met: 2 of 10
10. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 10
11. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 2 of 10
12. (take_image satellite2 phenomenon9 instrument5 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 3 of 10
13. (turn_to satellite1 phenomenon11 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 10
14. (take_image satellite1 phenomenon11 instrument3 spectrograph3)
   added: (have_image phenomenon11 spectrograph3)
   goals met: 4 of 10
15. (turn_to satellite1 planet13 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet13)
   goals met: 4 of 10
16. (take_image satellite1 planet13 instrument3 thermograph4)
   added: (have_image planet13 thermograph4)
   goals met: 5 of 10
17. (turn_to satellite1 star10 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star10)
   goals met: 5 of 10
18. (take_image satellite1 star10 instrument3 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 6 of 10
19. (turn_to satellite1 star5 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star5)
   goals met: 6 of 10
20. (take_image satellite1 star5 instrument3 thermograph4)
   added: (have_image star5 thermograph4)
   goals met: 7 of 10
21. (turn_to satellite1 star7 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star7)
   goals met: 7 of 10
22. (take_image satellite1 star7 instrument3 infrared1)
   added: (have_image star7 infrared1)
   goals met: 8 of 10
23. (turn_to satellite2 star6 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star6)
   goals met: 8 of 10
24. (take_image satellite2 star6 instrument5 infrared2)
   added: (have_image star6 infrared2)
   goals met: 9 of 10
25. (turn_to satellite2 groundstation2 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation2)
   goals met: 10 of 10
